{"basics":{"name":"Luke Bedrosian","label":"Aerospace Engineer","image":"","email":"lmbedrosian30@gmail.com","phone":"(224) 656-9310","url":"www.lukebedrosian.com","summary":"I am an aspiring space systems engineer and systems architect, that has applied my skills and knowledge to design, analyze, and optimize various aspects of satellite missions.","location":{"address":"1501 Northpoint Ln","postalCode":"TX 77840","city":"College Station","countryCode":"US","region":"Texas"},"profiles":[{"network":"LinkedIn","username":"lukebedrosian","url":"www.linkedin.com/in/lukebedrosian"}]},"work":[{"name":"The Aerospace Corporation","position":"Technical Intern","url":"https://aerospace.org/","startDate":"2023-5-23","endDate":"","summary":"System of Systems Engineering Office","highlights":["Independently implemented various graph analysis algorithms in C++/Qt and worked as part of a software engineering team to incorporate them into an existing space architecture modeling and visualization software tool.","Implemented probabilistic graph analysis algorithms using Monte Carlo simulation to estimate future performance of satellite networks.","Used an agile workflow including using git/bitbucket and JIRA for managing tasks.","Produced MBSE models of US cloud provider services (AWS, Azure, GCP, OCI, IBM) in SysML using the Cameo Systems Modeler for government customer's satellite ground enterprise.","Led discussions with government customer to establish rapport, clarify objectives, and define project scope, goals, and deliverables.","Led presentations of technical work and models to government customers in a clear and precise manner.","Produced MBSE SysML activity diagrams for Concept Design Center study analyzing Starship mission concepts for Hubble return and proliferated low Earth orbit constellations."]},{"name":"Systems Engineering, Architecture and Knowledge Lab","position":"Undergraduate Research Assistant","url":"https://www.selva-research.com/","startDate":"2023-12-12","endDate":"","summary":"PI: Daniel Selva Valero, Texas A&M University","highlights":["Developed a software architecture (Python) from scratch to take in a set of satellite design variables and parameters, size the satellite using industry-accepted heuristics and theoretical equations, and output the satellite design along with a “performance score” to be used as an objective function as part of a Lockheed-Martin funded cognitive assistant tool.","Implemented a multi-objective evolutionary algorithm (NSGA-II) using this architecture to explore the pareto front in the electric power system (EPS) design trade space.","Developed a multi-fidelity satellite simulation tool (Python, Ruby) with hardware-in-the-loop under Undergraduate Summer Research Grant.","Developed rules-based design algorithms (Java/JESS) using empirical relationships to size electric propulsion systems for satellites during early architecting phase."]}],"volunteer":[],"education":[{"institution":"Texas A&M University","url":"https://catalog.tamu.edu/undergraduate/engineering/aerospace/bs/#text","area":"B.S. Aerospace Engineering | Minors: Computer Science, Mathematics","studyType":"Bachelor of Science","startDate":"2020-8-81","endDate":"2024-5-5","score":"GPA: 3.8","courses":[""]}],"awards":[{"title":"Nobel Prize in Physics","date":"1921-11-01","awarder":"Royal Swedish Academy of Sciences","summary":"The Nobel Prizes are five separate prizes that, according to Alfred Nobel's will of 1895, are awarded to 'those who, during the preceding year, have conferred the greatest benefit to humankind.'"}],"certificates":[],"publications":[],"skills":[],"languages":[{"language":"German","fluency":"Native speaker"},{"language":"English","fluency":"Fluent"}],"interests":[],"references":[],"projects":[]}